bdd/02_diseno_conceptual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-04 Thu 17:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diseño Conceptual</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
</head>
<body>
<div id="content">
<div id="outline-container-orgae372a5" class="outline-2">
<h2 id="orgae372a5">Diseño conceptual</h2>
<div class="outline-text-2" id="text-orgae372a5">
<p>
Modelo conceptual
</p>
<blockquote>
<p>
Describe la semántica de los datos, incluyendo sus característicastanto
estáticas como dinámicas.
</p>
</blockquote>

<p>
Recordemos que las bases de datos tradicionales almacenan datosque pueden
enunciarse a través deproposiciones. Un modelo dedatos debe incluir los
siguientes elementos:
</p>
<ul class="org-ul">
<li>Un conjunto de objetos, sus propiedades e interrelaciones entre ellos, que
representa la estructura.</li>
<li>Un conjunto de operaciones, o lenguaje, que permite manipularlos datos.</li>
<li>Restricciones sobre los objetos, las interrelaciones y las operaciones.</li>
</ul>

<p>
Algunas herramientas para el diseño conceptual:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1969</td>
<td class="org-left">Diagrama de Estructura de Datos (Bachman)</td>
</tr>

<tr>
<td class="org-right">1976</td>
<td class="org-left">Diagrama Entidad-Interrelación (Chen)</td>
</tr>

<tr>
<td class="org-right">1981</td>
<td class="org-left">→Notación de Barker (Oracle)</td>
</tr>

<tr>
<td class="org-right">1985</td>
<td class="org-left">→IDEF1X (U.S. Air Force)</td>
</tr>

<tr>
<td class="org-right">1997</td>
<td class="org-left">UML (Booch, Jacobson, Rumbaug)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org23119f8" class="outline-2">
<h2 id="org23119f8">Modelo Entidad-Interrelación (ER)</h2>
<div class="outline-text-2" id="text-org23119f8">
<p>
Modelo Entidad-Interrelación
</p>
<blockquote>
<p>
En 1976 P.Chen propuso un modelo esquemático basado en entidades,interrelaciones
y atributos para el modelado semántico de datos
</p>
</blockquote>

<ul class="org-ul">
<li>Tipo de Entidad: Es un tipo o clase de objeto en particular.
<ul class="org-ul">
<li>Ejemplos:  Futbolista,  País,  Canción</li>
<li>Una entidad es unainstanciade un tipo de entidad.
<ul class="org-ul">
<li>Ej.: Gonzalo Higuaín (Futbolista), Rusia (País), Scooby Doo Papa (Canc.)</li>
</ul></li>
</ul></li>

<li>Atributo: Es una propiedad que describe a la entidad.
<ul class="org-ul">
<li>Ejemplos: Futbolista→Cotización , País→Población, Canción→Duración</li>
</ul></li>

<li>Tipo de interrelación: Es la definición de un conjunto de relaciones o</li>
</ul>
<p>
asociaciones similares entre dos ó más tipos de entidades.
</p>
<ul class="org-ul">
<li>Ejemplo: Futbolista nació en País</li>
<li>Una interrelación en concreto es: Didier Drogba nació en Costa de Marfil.</li>
</ul>

<p>
El diagrama Entidad-Interrelación representa los tipos de entidades ysus
atributos como:
</p>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Pa&#237;s [shape=record];
Pa&#237;s -- Nombre;
Pa&#237;s -- Poblaci&#243;n;
Pa&#237;s -- Superficie;
}
</pre>
</div>

<p>
Y los tipos de interrelaciones con:
</p>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Futbolista [shape=record];
Pa&#237;s [shape=record];
<span style="color: #98be65;">"naci&#243; en"</span> [shape=diamond];
Futbolista -- <span style="color: #98be65;">"naci&#243; en"</span> -- Pa&#237;s;
}
</pre>
</div>
</div>

<div id="outline-container-orgb401e0d" class="outline-3">
<h3 id="orgb401e0d">Atributos</h3>
<div class="outline-text-3" id="text-orgb401e0d">
<ul class="org-ul">
<li>Cada entidad tendrá valores particulares para cada uno de los atributos del
tipo de entidad al que corresponde.
<ul class="org-ul">
<li>Los representaremos de la siguiente forma:
<ul class="org-ul">
<li>Ejemplo para el tipo de entidad País(nombre, población,
superficie):</li>
</ul></li>
</ul></li>
</ul>

<p>
PAÍS
</p>
<ul class="org-ul">
<li>(Argentina, 40.117.096, 2.780.400km<sup>2</sup>)</li>
<li>(Costa de Marfil, 22.848.945, 322.463km<sup>2</sup>)</li>
<li>&#x2026;</li>

<li>El dominio de un atributo es el conjunto de valores que el mismo puede tomar.
Para la entidad País:
<ul class="org-ul">
<li>El atributo nombre es una cadena de caracteres(string).</li>
<li>El atributo población es un número entero positivo.</li>
<li>El atributo superficie es un número real positivo.</li>
</ul></li>

<li>En ciertos casos puede permitirse que un atributo de un tipo de entidad no
tome ningún valor concreto en ciertas instancias. En estos casos diremos que
el atributo toma un <b>valor nulo</b> ó <b>NULL</b>.</li>
<li>Esta situación se da en general por alguno de los siguientesmotivos:
<ul class="org-ul">
<li>La entidad particular no posee aún ese atributo. (Ejemplo: un futbolista que
nunca fue cotizado.)</li>
<li>El valor de ese atributo para esa entidad se desconoce, aunque existe.
(Ejemplo: un país en que no hay censos de población.)</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org6c64878" class="outline-4">
<h4 id="org6c64878">Atributos compuestos vs. simples</h4>
<div class="outline-text-4" id="text-org6c64878">
<p>
Ejemplo: Tarjeta de crédito
</p>

<p>
imagen
</p>
</div>
</div>

<div id="outline-container-org85129e9" class="outline-4">
<h4 id="org85129e9">Atributos multivaluados vs. monovaluados</h4>
<div class="outline-text-4" id="text-org85129e9">
<p>
Ejemplo: teléfono y mail de contacto
</p>

<p>
imagen
</p>
</div>
</div>

<div id="outline-container-orgc8604a2" class="outline-4">
<h4 id="orgc8604a2">Atributos almacenados vs. derivados</h4>
<div class="outline-text-4" id="text-orgc8604a2">
<p>
Ejemplo: densidad de población
</p>

<p>
imagen
</p>
</div>
</div>
</div>

<div id="outline-container-orged2d928" class="outline-3">
<h3 id="orged2d928">Entidades</h3>
<div class="outline-text-3" id="text-orged2d928">
</div>
<div id="outline-container-orgf50e12c" class="outline-4">
<h4 id="orgf50e12c">Conjunto de entidades</h4>
<div class="outline-text-4" id="text-orgf50e12c">
<p>
Al conjunto de ocurrencias o instancias de un determinado tipo deentidad en un
estado determinado de la base de datos se lo denominaconjunto de entidades de
ese tipo de entidad.
</p>

<p>
Por ejemplo, para el tipo de entidad País, nuestra base de datos podría
tenercargadas en un momento dado las siguientes instancias:
</p>

<p>
PAÍS(nombre, población, superficie)
</p>
<ul class="org-ul">
<li>(Argentina, 40.117.096, 2.780.400km<sup>2</sup>)</li>
<li>(Costa de Marfil, 22.848.945, 322.463km<sup>2</sup>)</li>
<li>(Serbia y Montenegro, 10.829.175, 102.350km<sup>2</sup>)</li>
<li>(Países Bajos, 17.000.074, 41.543km<sup>2</sup>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbae7554" class="outline-4">
<h4 id="orgbae7554">Restricción de unicidad</h4>
<div class="outline-text-4" id="text-orgbae7554">
<ul class="org-ul">
<li>Todo tipo de entidad debe tener un subconjunto del conjunto deatributos cuyos
valores sean necesariamente distintos para cadauna de las entidades en el
conjunto de entidades.</li>
<li>Dichos atributos se llaman atributos clave o identificadores únicos.</li>
<li>Si no los encontramos, debemos crear uno (id).</li>
<li>Al ser distintos para cada entidad, los atributos clave permitenidentificar
unívocamente a las entidades.</li>
</ul>

<p>
En el diagrama Entidad-Interrelación los representamos subrayados:
</p>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Pa&#237;s [shape=record];
Pa&#237;s -- __Nombre__;
Pa&#237;s -- Poblaci&#243;n;
Pa&#237;s -- Superficie;
}
</pre>
</div>

<ul class="org-ul">
<li>El conjunto de atributos clave debe ser minimal, es decir, ningún subconjunto
del mismo debe ser capaz de identificar unívocamente a las entidades.</li>
<li>Aún así, es posible que exista más de un conjunto de atributos clave para un
tipo de entidad.</li>
</ul>

<pre class="example">
Atención! La restricción de unicidad para los valores delos atributos clave no
es una propiedad del conjunto deentidades en el estado actual de la base de
datos, sinoque es una restricción respecto a todos los estadosposibles de la
misma.
</pre>
</div>
</div>
</div>

<div id="outline-container-orga99cae9" class="outline-3">
<h3 id="orga99cae9">Interrelaciones</h3>
<div class="outline-text-3" id="text-orga99cae9">
</div>
<div id="outline-container-org17614f1" class="outline-4">
<h4 id="org17614f1">Aridad</h4>
<div class="outline-text-4" id="text-org17614f1">
<ul class="org-ul">
<li>La aridad ó grado de un tipo de interrelación es la cantidad detipos de
entidad que coparticipan del mismo.</li>
<li>Comenzaremos analizando tipos de interrelación <i>binarios</i>, esdecir aquellos en
que participan dos tipos de entidades.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Futbolista [shape=record];
Pa&#237;s [shape=record];
<span style="color: #98be65;">"naci&#243; en"</span> [shape=diamond];
Futbolista -- <span style="color: #98be65;">"naci&#243; en"</span> -- Pa&#237;s;
}
</pre>
</div>
</div>
</div>
