org/bdd/02_diseno_conceptual.org
*** Restricciones de cardinalidad
    - La cardinalidad es la máxima cantidad de instancias de cada tipo de entidad
      que pueden relacionarse con una instancia concreta de los tipos de entidades
      restantes.
    - Ejemplo:
      - Un futbolista sólo puede haber nacido en un único país.
      - En un país pueden haber nacido muchos futbolistas.
    - En interrelaciones binarias las cardinalidades posibles son:1:1, 1:N, N:1 y
      M:N.

    #+BEGIN_SRC dot
graph g {
Futbolista [shape=record];
País [shape=record];
"nació en" [shape=diamond];
Futbolista -- "nació en" [label="N"];
"nació en" -- País [label="1"];
}
    #+END_SRC

*** Restricciones de participación
    - La participación es la mínima cantidad de instancias de cada tipode entidad
      que deben relacionarse con una instancia concreta delos tipos de entidades
      restantes.
    - Ejemplo:
      - Un futbolista debe haber nacido en algún país.
      - En un país puede no haber nacido ningún futbolista.
    - Cuando requerimos que cada instancia de E1 participe de alguna instancia de r1
      para poder subsistir, diremos que E1 tiene participación total o dependencia
      existencial en r1. En caso contrario diremos que tiene participación parcial.
    - Los indicaremos como (min,max) en el diagrama, en donde min denotará la
      participación y max denotará la cardinalidad del tipo de entidad en una
      interrelación dada.

    #+BEGIN_SRC dot
graph g {
Futbolista [shape=record];
País [shape=record];
"nació en" [shape=diamond];
Futbolista -- "nació en" [label="(0,N)"];
"nació en" -- País [label="(1,1)"];
}
    #+END_SRC

    - Restricciones de cardinalidad + Restricciones de participación =
      *Restricciones estructurales*

    #+BEGIN_QUOTE
    Atención! En el libro de Elmasri y Navathe los índices seubican invertidos.
    Nosotros seguiremos la notación deesta diapositiva.
    #+END_QUOTE

*** Atributos
    - Las interrelaciones también pueden tener atributos.
    - Ejemplo: registro de asignaturas aprobadas por los alumnos de una facultad.

    #+BEGIN_SRC dot
graph g {
Alumno [shape=record];
Asignatura [shape=record];
aprobó [shape=diamond];
Alumno -- aprobó [label="N"];
aprobó -- Asignatura [label="M"];
aprobó -- Fecha;
Alumno -- __Padrón__;
Alumno -- Nombre;
Asignatura -- __Código__;
Asignatura -- Nombre;
}
    #+END_SRC

*** Restricción de unicidad
    - En los tipos de interrelaciones también debemos identificar un conjunto de
      atributos clave.
    - Pueden formar parte de estos atributos clave los atributos clave de los tipos
      de entidad que participan de la misma.
    - Recordar que la propiedad de los atributos clave es que sitomamos dos
      instancias distintas de un tipo de interrelación, los valores de su conjunto
      de atributos clave deben ser distintos.

    En general la elección de atributos clave está fuertemente condicionada por la
    cardinalidad.

**** Cardinalidad 1:1

     #+BEGIN_SRC dot
graph g {
Gerente [shape=record];
dirige [shape=diamond];
Departamento [shape=record];
Gerente -- dirige -- Departamento [label="1"];
Gerente -- __Nombre__;
Gerente -- Telefono;
Gerente -- Mail;
Departamento -- Nombre;
Departamento -- __Codigo__;
}
     #+END_SRC

     - La clave es {Gerente.Nombre}
     - Aunque tambien podria ser {Departamento.Codigo}

**** Cardinalidad 1:N

     #+BEGIN_SRC dot
graph g {
Escritor [shape=record];
escribio [shape=diamond];
Libro [shape=record];
Escritor -- escribio [label="1"];
escribio -- Libro [label="N"];
Escritor -- __Nombre__;
Escritor -- Pais;
Libro -- Idioma;
Libro -- __Nombre__;
Libro -- Genero;
}
     #+END_SRC

     - La clave es {Libro.Nombre}

**** Cardinalidad N:M

     #+BEGIN_SRC dot
graph g {
Escritor [shape=record];
tiene [shape=diamond];
Titulo [shape=record];
Escritor -- tiene [label="N"];
tiene -- Titulo [label="M"];
Escritor -- Nombre;
Escritor -- __DNI__;
Titulo -- __Nombre__;
}
     #+END_SRC

     - La clave es {Persona.DNI, Titulo.Nombre}

* Ejemplos

** Ejemplo 1

   Los dueños de esta librería desean crear una base de datos que contenga
   información sobre los libros actualmente en venta, y que permita hacer búsquedas
   por nombre o país de origen del autor, género, idioma y año.

   1. Paso 1: Identificar tipos de entidad
   2. Paso 2: Identificar atributos
   3. Paso 3: Identificar tipos de interrelación
   4. Paso 4: Identificar atributos clave
   5. Paso 5: Identificar restricciones estructurales

   #+BEGIN_SRC dot
graph g {
Autor [shape=record];
Genero [shape=record];
Libro [shape=record];
pertenece [shape=diamond];
escribio [shape=diamond];
Autor -- Pais;
Autor -- Nombre;
Autor -- FechaNac;
Autor -- __ID_autor__;
Autor -- escribio [label="M"];
Genero -- __Codigo__;
Genero -- Nombre;
Genero -- pertenece [label="N"];
Libro -- Unidades;
Libro -- Año;
Libro -- Idioma;
Libro -- Nombre;
Libro -- __ISBN__;
Libro -- pertenece [label="M"];
Libro -- escribio [label="N"];
}
   #+END_SRC

** Ejemplo 2

   El Registro Nacional de las Personas quiere mantener una base de datos con el
   nombre, DNI, género y fecha de nacimiento de cada ciudadano argentino. Asimismo
   desea tener registrados todos los matrimonios en curso (no divorciados)
   incluyendo la fecha de matrimonio, y los nacimientos de personas indicando la
   identidad de los padres en caso que la misma sea conocida.
   Hipótesis: Suponga que todas las personas son argentinas.

   1. Paso 1: Identificar tipos de entidad
   2. Paso 2: Identificar atributos
   3. Paso 3: Identificar tipos de interrelación
   4. Paso 4: Identificar atributos clave
   5. Paso 5: Identificar restricciones estructurales


   #+BEGIN_SRC dot
graph g {
Persona [shape=record];
"hijo de" [shape=diamond];
casada [shape=diamond];
Persona -- FechaNac;
Persona -- Nombre;
Persona -- __DNI__;
Persona -- Genero;
Persona -- casada [label="1"];
Persona -- casada [label="1"];
Persona -- "hijo de" [label="2 (padre)"];
Persona -- "hijo de" [label="M (hijo)"];
casada -- FechaMatrimonio;
}
   #+END_SRC

   - Aquí aparecen tipos de interrelación recursivos o unarios.
   - Para el tipo de interrelación “hijo de” nos interesa remarcar el rol de cada
     tipo de entidad.

* Modelo ER avanzado

