bdd/02_diseno_conceptual.html

<div id="outline-container-orgceaaa56" class="outline-4">
<h4 id="orgceaaa56">Restricciones de cardinalidad</h4>
<div class="outline-text-4" id="text-orgceaaa56">
<ul class="org-ul">
<li>La cardinalidad es la máxima cantidad de instancias de cada tipo de entidad
que pueden relacionarse con una instancia concreta de los tipos de entidades
restantes.</li>
<li>Ejemplo:
<ul class="org-ul">
<li>Un futbolista sólo puede haber nacido en un único país.</li>
<li>En un país pueden haber nacido muchos futbolistas.</li>
</ul></li>
<li>En interrelaciones binarias las cardinalidades posibles son:1:1, 1:N, N:1 y
M:N.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Futbolista [shape=record];
Pa&#237;s [shape=record];
<span style="color: #98be65;">"naci&#243; en"</span> [shape=diamond];
Futbolista -- <span style="color: #98be65;">"naci&#243; en"</span> [label=<span style="color: #98be65;">"N"</span>];
<span style="color: #98be65;">"naci&#243; en"</span> -- Pa&#237;s [label=<span style="color: #98be65;">"1"</span>];
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org117af13" class="outline-4">
<h4 id="org117af13">Restricciones de participación</h4>
<div class="outline-text-4" id="text-org117af13">
<ul class="org-ul">
<li>La participación es la mínima cantidad de instancias de cada tipode entidad
que deben relacionarse con una instancia concreta delos tipos de entidades
restantes.</li>
<li>Ejemplo:
<ul class="org-ul">
<li>Un futbolista debe haber nacido en algún país.</li>
<li>En un país puede no haber nacido ningún futbolista.</li>
</ul></li>
<li>Cuando requerimos que cada instancia de E1 participe de alguna instancia de r1
para poder subsistir, diremos que E1 tiene participación total o dependencia
existencial en r1. En caso contrario diremos que tiene participación parcial.</li>
<li>Los indicaremos como (min,max) en el diagrama, en donde min denotará la
participación y max denotará la cardinalidad del tipo de entidad en una
interrelación dada.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Futbolista [shape=record];
Pa&#237;s [shape=record];
<span style="color: #98be65;">"naci&#243; en"</span> [shape=diamond];
Futbolista -- <span style="color: #98be65;">"naci&#243; en"</span> [label=<span style="color: #98be65;">"(0,N)"</span>];
<span style="color: #98be65;">"naci&#243; en"</span> -- Pa&#237;s [label=<span style="color: #98be65;">"(1,1)"</span>];
}
</pre>
</div>

<ul class="org-ul">
<li>Restricciones de cardinalidad + Restricciones de participación =
<b>Restricciones estructurales</b></li>
</ul>

<blockquote>
<p>
Atención! En el libro de Elmasri y Navathe los índices seubican invertidos.
Nosotros seguiremos la notación deesta diapositiva.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7baad41" class="outline-4">
<h4 id="org7baad41">Atributos</h4>
<div class="outline-text-4" id="text-org7baad41">
<ul class="org-ul">
<li>Las interrelaciones también pueden tener atributos.</li>
<li>Ejemplo: registro de asignaturas aprobadas por los alumnos de una facultad.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Alumno [shape=record];
Asignatura [shape=record];
aprob&#243; [shape=diamond];
Alumno -- aprob&#243; [label=<span style="color: #98be65;">"N"</span>];
aprob&#243; -- Asignatura [label=<span style="color: #98be65;">"M"</span>];
aprob&#243; -- Fecha;
Alumno -- __Padr&#243;n__;
Alumno -- Nombre;
Asignatura -- __C&#243;digo__;
Asignatura -- Nombre;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf73ae52" class="outline-4">
<h4 id="orgf73ae52">Restricción de unicidad</h4>
<div class="outline-text-4" id="text-orgf73ae52">
<ul class="org-ul">
<li>En los tipos de interrelaciones también debemos identificar un conjunto de
atributos clave.</li>
<li>Pueden formar parte de estos atributos clave los atributos clave de los tipos
de entidad que participan de la misma.</li>
<li>Recordar que la propiedad de los atributos clave es que sitomamos dos
instancias distintas de un tipo de interrelación, los valores de su conjunto
de atributos clave deben ser distintos.</li>
</ul>

<p>
En general la elección de atributos clave está fuertemente condicionada por la
cardinalidad.
</p>
</div>

<div id="outline-container-orgc287acf" class="outline-5">
<h5 id="orgc287acf">Cardinalidad 1:1</h5>
<div class="outline-text-5" id="text-orgc287acf">
<div class="org-src-container">
<pre class="src src-dot">graph g {
Gerente [shape=record];
dirige [shape=diamond];
Departamento [shape=record];
Gerente -- dirige -- Departamento [label=<span style="color: #98be65;">"1"</span>];
Gerente -- __Nombre__;
Gerente -- Telefono;
Gerente -- Mail;
Departamento -- Nombre;
Departamento -- __Codigo__;
}
</pre>
</div>

<ul class="org-ul">
<li>La clave es {Gerente.Nombre}</li>
<li>Aunque tambien podria ser {Departamento.Codigo}</li>
</ul>
</div>
</div>

<div id="outline-container-org8552011" class="outline-5">
<h5 id="org8552011">Cardinalidad 1:N</h5>
<div class="outline-text-5" id="text-org8552011">
<div class="org-src-container">
<pre class="src src-dot">graph g {
Escritor [shape=record];
escribio [shape=diamond];
Libro [shape=record];
Escritor -- escribio [label=<span style="color: #98be65;">"1"</span>];
escribio -- Libro [label=<span style="color: #98be65;">"N"</span>];
Escritor -- __Nombre__;
Escritor -- Pais;
Libro -- Idioma;
Libro -- __Nombre__;
Libro -- Genero;
}
</pre>
</div>

<ul class="org-ul">
<li>La clave es {Libro.Nombre}</li>
</ul>
</div>
</div>

<div id="outline-container-org2aa8655" class="outline-5">
<h5 id="org2aa8655">Cardinalidad N:M</h5>
<div class="outline-text-5" id="text-org2aa8655">
<div class="org-src-container">
<pre class="src src-dot">graph g {
Escritor [shape=record];
tiene [shape=diamond];
Titulo [shape=record];
Escritor -- tiene [label=<span style="color: #98be65;">"N"</span>];
tiene -- Titulo [label=<span style="color: #98be65;">"M"</span>];
Escritor -- Nombre;
Escritor -- __DNI__;
Titulo -- __Nombre__;
}
</pre>
</div>

<ul class="org-ul">
<li>La clave es {Persona.DNI, Titulo.Nombre}</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga213cb7" class="outline-2">
<h2 id="orga213cb7">Ejemplos</h2>
<div class="outline-text-2" id="text-orga213cb7">
</div>
<div id="outline-container-org54ef747" class="outline-3">
<h3 id="org54ef747">Ejemplo 1</h3>
<div class="outline-text-3" id="text-org54ef747">
<p>
Los dueños de esta librería desean crear una base de datos que contenga
información sobre los libros actualmente en venta, y que permita hacer búsquedas
por nombre o país de origen del autor, género, idioma y año.
</p>

<ol class="org-ol">
<li>Paso 1: Identificar tipos de entidad</li>
<li>Paso 2: Identificar atributos</li>
<li>Paso 3: Identificar tipos de interrelación</li>
<li>Paso 4: Identificar atributos clave</li>
<li>Paso 5: Identificar restricciones estructurales</li>
</ol>

<div class="org-src-container">
<pre class="src src-dot">graph g {
Autor [shape=record];
Genero [shape=record];
Libro [shape=record];
pertenece [shape=diamond];
escribio [shape=diamond];
Autor -- Pais;
Autor -- Nombre;
Autor -- FechaNac;
Autor -- __ID_autor__;
Autor -- escribio [label=<span style="color: #98be65;">"M"</span>];
Genero -- __Codigo__;
Genero -- Nombre;
Genero -- pertenece [label=<span style="color: #98be65;">"N"</span>];
Libro -- Unidades;
Libro -- A&#241;o;
Libro -- Idioma;
Libro -- Nombre;
Libro -- __ISBN__;
Libro -- pertenece [label=<span style="color: #98be65;">"M"</span>];
Libro -- escribio [label=<span style="color: #98be65;">"N"</span>];
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ec64ab" class="outline-3">
<h3 id="org7ec64ab">Ejemplo 2</h3>
<div class="outline-text-3" id="text-org7ec64ab">
<p>
El Registro Nacional de las Personas quiere mantener una base de datos con el
nombre, DNI, género y fecha de nacimiento de cada ciudadano argentino. Asimismo
desea tener registrados todos los matrimonios en curso (no divorciados)
incluyendo la fecha de matrimonio, y los nacimientos de personas indicando la
identidad de los padres en caso que la misma sea conocida.
Hipótesis: Suponga que todas las personas son argentinas.
</p>

<ol class="org-ol">
<li>Paso 1: Identificar tipos de entidad</li>
<li>Paso 2: Identificar atributos</li>
<li>Paso 3: Identificar tipos de interrelación</li>
<li>Paso 4: Identificar atributos clave</li>
<li>Paso 5: Identificar restricciones estructurales</li>
</ol>


<div class="org-src-container">
<pre class="src src-dot">graph g {
Persona [shape=record];
<span style="color: #98be65;">"hijo de"</span> [shape=diamond];
casada [shape=diamond];
Persona -- FechaNac;
Persona -- Nombre;
Persona -- __DNI__;
Persona -- Genero;
Persona -- casada [label=<span style="color: #98be65;">"1"</span>];
Persona -- casada [label=<span style="color: #98be65;">"1"</span>];
Persona -- <span style="color: #98be65;">"hijo de"</span> [label=<span style="color: #98be65;">"2 (padre)"</span>];
Persona -- <span style="color: #98be65;">"hijo de"</span> [label=<span style="color: #98be65;">"M (hijo)"</span>];
casada -- FechaMatrimonio;
}
</pre>
</div>

<ul class="org-ul">
<li>Aquí aparecen tipos de interrelación recursivos o unarios.</li>
<li>Para el tipo de interrelación “hijo de” nos interesa remarcar el rol de cada
tipo de entidad.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbde556a" class="outline-2">
<h2 id="orgbde556a">Modelo ER avanzado</h2>
<div class="outline-text-2" id="text-orgbde556a">
</div>
