org/bdd/02_diseno_conceptual.org
** Entidades fuertes y debiles

   A veces la identificación de una entidad depende de su interrelación
   con otra entidad, a la cual está subordinada. Ejemplo:

   #+BEGIN_SRC dot

   #+END_SRC

   - Cuando un tipo de entidad depende de otro para subsistir, se dice que es un
     tipo de entidad débil.
   - La clave de una entidad débil se compone de la clave de su entidad
     identificadora, más algún/os atributos propios, que se denominan
     discriminantes, y se indican con líneas punteadas.

   Un tipo de entidad debil siempre tiene participacion total en el tipo de
   interrelacion que vincula con su tipo de entidad identificadora.

   - Cuidado! Supongamos que queremos modelar las visitas de los pacientes en una
     clinica. Claramente, un paciente puede visitar a su medico muchas veces...

   mal
   #+BEGIN_SRC dot

   #+END_SRC

   - Pero este diseño es erroneo: el atributo "Fecha" no puede ser parte de la
     clave de la interrelacion!

   - En un diseño correcto, la Visita debería ser una entidad en sí
   misma:

   #+BEGIN_SRC dot

   #+END_SRC

   - La clave de Visita es entonces {NroHistClínica, Legajo, Fecha}.

** Interrelaciones ternarias

   - Son aquellas en que participan 3 tipos de entidad distintos.
   - Ejemplo: En un concurso de canto se organizan rondas temáticas en las que se
     inscriben algunos participantes. En cada ronda, los cantantes que participan
     son calificados por una serie de jurados.

   #+BEGIN_SRC dot

   #+END_SRC

   Aquí, la cardinalidad de una entidad determina la cantidad de instancias de
   interrelación en que puede aparecer, fijadas las instancias de los otros dos
   tipos de entidades.

*** Cardinalidad y atributos clave

    Las cardinalidades correspondientes son:

    #+BEGIN_SRC dot

    #+END_SRC

    Y el conjunto de atributos clave es {Cantante.NroInscripcion, Ronda.NroRonda,
    Jurado.Nombre}

** Generalizacion y especializacion

   La especializacion y la generalizacion nos permiten representar relaciones de
   tipo "es un" en el modelo de datos

   #+BEGIN_SRC dot

   #+END_SRC

   Ejemplo: Docentes y alumnos de una facultad

   #+BEGIN_SRC dot

   #+END_SRC

   - Los subtipos de entidad son subclases del tipo de entidad padre.
   - A través de la especialización se heredan atributos del tipo de entidad padre,
     al igual que los tipos de interrelación de los que la misma participa.
   - Pero a su vez, los subtipos de entidad pueden tener atributos propios.
   - Toda instancia de un subtipo de entidad debe corresponderse necesariamente con
     una y sólo una instancia del tipo de entidad padre.
   - Resulta conveniente definir subtipos de entidad en nuestros modelos cuando:
     - Algunos atributos no se aplican a todas las instancias del tipo de entidad
       padre.
     - Un tipo de interrelación no se aplica a todas las instancias del tipo de
       entidad padre.

*** Propiedades

    Analizaremos 2 propiedades de estas relaciones:

    - Superposición: Los subtipos de entidad pueden ser disjuntos o superpuestos. En
      caso de ser superpuestos, una instancia del tipo de entidad padre puede
      corresponderse con instancias de varios subtipos de entidad.
    - Completitud: Los subtipos de entidad pueden cubrir a todo el tipo de entidad
      padre (total), o no (parcial). En caso de no cubrirlo, puede ocurrir que
      algunas instancias del tipo de entidad padre no se correspondan con ningún
      subtipo de entidad.

    En el ejemplo anterior, la especialización es superpuesta (una persona puede ser
    alumno y docente a la vez) y total (toda persona registrada debe ser alumno o
    docente). Lo indicaremos por escrito como muestra el diagrama anterior.

** Union

   - En la unión también tenemos un tipo de entidad padre y distintos subtipos de
     entidad.
   - Pero ahora el tipo de entidad padre es subclase de los subtipos de entidad
     (que son la superclase).
   - Esto implicará que los identificadores estarán en los subtipos de entidad,
     mientras que el tipo de entidad padre incorporará nuevos atributos.
   - Las instancias del tipo de entidad padre deben corresponderse con a lo sumo
     una instancia de los subtipos de entidad.

   Atención! En alguna bibliografía no se distingue a la unión de la generalización
   / especialización.

   Ejemplo: Un banco trabaja con personas físicas y personas jurídicas radicadas en
   argentina.

   #+BEGIN_SRC dot

   #+END_SRC

* Ejemplos avanzados

** Ejemplo 3

   La biblioteca necesita para funcionar una base de datos que mantenga un registro
   sobre los socios, los ejemplares de libros existentes y los préstamos en curso,
   de manera que se pueda consultar la disponibilidad de un cierto libro a partir
   del nombre, los ejemplares prestados a un determinado socio, y si existen socios
   con préstamos que daten más de una cierta fecha.

   1. Paso 1: Identificar tipos de entidad
   2. Paso 2: Identificar atributos
   3. Paso 3: Identificar tipos de interrelación
   4. Paso 4: Identificar atributos clave
   5. Paso 5: Identificar restricciones estructurales

   #+BEGIN_SRC dot

   #+END_SRC

** Ejemplo 4

   Volvemos a considerar el caso del Registro Nacional de las Personas, pero
   permitiendo también registrar a ciudadanos no argentinos cuando los mismos
   contraen matrimonio con ciudadanos argentinos o se inscriben como padres de
   ciudadanos nacidos argentinos.

   1. Paso 1: Identificar tipos de entidad
   2. Paso 2: Identificar atributos
   3. Paso 3: Identificar tipos de interrelación
   4. Paso 4: Identificar atributos clave
   5. Paso 5: Identificar restricciones estructurales

   #+BEGIN_SRC dot

   #+END_SRC

* Apéndice: Software de diseño conceptual

  - Software CASE:
    - ERWin
      - No soporta notación de Chen; pago
    - MS Visio
      - Pago
    - Visual Paradigm
      - No soporta notación de Chen; tiene versión comunitaria gratis para uso no
        comercial
    - MySQL Workbench
      - No soporta notación de Chen
  - Software no-CASE:
    - Dia
    - LaTeX TikZ package
    - draw.io
    - Menos conocidos: SmartDraw (pago); Edraw (pago)

