bdd/02_diseno_conceptual.html
<div id="outline-container-orgcaf049d" class="outline-3">
<h3 id="orgcaf049d">Entidades fuertes y debiles</h3>
<div class="outline-text-3" id="text-orgcaf049d">
<p>
A veces la identificación de una entidad depende de su interrelación
con otra entidad, a la cual está subordinada. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<ul class="org-ul">
<li>Cuando un tipo de entidad depende de otro para subsistir, se dice que es un
tipo de entidad débil.</li>
<li>La clave de una entidad débil se compone de la clave de su entidad
identificadora, más algún/os atributos propios, que se denominan
discriminantes, y se indican con líneas punteadas.</li>
</ul>

<p>
Un tipo de entidad debil siempre tiene participacion total en el tipo de
interrelacion que vincula con su tipo de entidad identificadora.
</p>

<ul class="org-ul">
<li>Cuidado! Supongamos que queremos modelar las visitas de los pacientes en una
clinica. Claramente, un paciente puede visitar a su medico muchas veces&#x2026;</li>
</ul>

<p>
mal
</p>
<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<ul class="org-ul">
<li>Pero este diseño es erroneo: el atributo "Fecha" no puede ser parte de la
clave de la interrelacion!</li>

<li>En un diseño correcto, la Visita debería ser una entidad en sí</li>
</ul>
<p>
misma:
</p>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<ul class="org-ul">
<li>La clave de Visita es entonces {NroHistClínica, Legajo, Fecha}.</li>
</ul>
</div>
</div>

<div id="outline-container-org703d2bb" class="outline-3">
<h3 id="org703d2bb">Interrelaciones ternarias</h3>
<div class="outline-text-3" id="text-org703d2bb">
<ul class="org-ul">
<li>Son aquellas en que participan 3 tipos de entidad distintos.</li>
<li>Ejemplo: En un concurso de canto se organizan rondas temáticas en las que se
inscriben algunos participantes. En cada ronda, los cantantes que participan
son calificados por una serie de jurados.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<p>
Aquí, la cardinalidad de una entidad determina la cantidad de instancias de
interrelación en que puede aparecer, fijadas las instancias de los otros dos
tipos de entidades.
</p>
</div>

<div id="outline-container-orgda6a5c6" class="outline-4">
<h4 id="orgda6a5c6">Cardinalidad y atributos clave</h4>
<div class="outline-text-4" id="text-orgda6a5c6">
<p>
Las cardinalidades correspondientes son:
</p>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<p>
Y el conjunto de atributos clave es {Cantante.NroInscripcion, Ronda.NroRonda,
Jurado.Nombre}
</p>
</div>
</div>
</div>

<div id="outline-container-orgb6bd250" class="outline-3">
<h3 id="orgb6bd250">Generalizacion y especializacion</h3>
<div class="outline-text-3" id="text-orgb6bd250">
<p>
La especializacion y la generalizacion nos permiten representar relaciones de
tipo "es un" en el modelo de datos
</p>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<p>
Ejemplo: Docentes y alumnos de una facultad
</p>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>

<ul class="org-ul">
<li>Los subtipos de entidad son subclases del tipo de entidad padre.</li>
<li>A través de la especialización se heredan atributos del tipo de entidad padre,
al igual que los tipos de interrelación de los que la misma participa.</li>
<li>Pero a su vez, los subtipos de entidad pueden tener atributos propios.</li>
<li>Toda instancia de un subtipo de entidad debe corresponderse necesariamente con
una y sólo una instancia del tipo de entidad padre.</li>
<li>Resulta conveniente definir subtipos de entidad en nuestros modelos cuando:
<ul class="org-ul">
<li>Algunos atributos no se aplican a todas las instancias del tipo de entidad
padre.</li>
<li>Un tipo de interrelación no se aplica a todas las instancias del tipo de
entidad padre.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgd1ae659" class="outline-4">
<h4 id="orgd1ae659">Propiedades</h4>
<div class="outline-text-4" id="text-orgd1ae659">
<p>
Analizaremos 2 propiedades de estas relaciones:
</p>

<ul class="org-ul">
<li>Superposición: Los subtipos de entidad pueden ser disjuntos o superpuestos. En
caso de ser superpuestos, una instancia del tipo de entidad padre puede
corresponderse con instancias de varios subtipos de entidad.</li>
<li>Completitud: Los subtipos de entidad pueden cubrir a todo el tipo de entidad
padre (total), o no (parcial). En caso de no cubrirlo, puede ocurrir que
algunas instancias del tipo de entidad padre no se correspondan con ningún
subtipo de entidad.</li>
</ul>

<p>
En el ejemplo anterior, la especialización es superpuesta (una persona puede ser
alumno y docente a la vez) y total (toda persona registrada debe ser alumno o
docente). Lo indicaremos por escrito como muestra el diagrama anterior.
</p>
</div>
</div>
</div>

<div id="outline-container-org6c3aba4" class="outline-3">
<h3 id="org6c3aba4">Union</h3>
<div class="outline-text-3" id="text-org6c3aba4">
<ul class="org-ul">
<li>En la unión también tenemos un tipo de entidad padre y distintos subtipos de
entidad.</li>
<li>Pero ahora el tipo de entidad padre es subclase de los subtipos de entidad
(que son la superclase).</li>
<li>Esto implicará que los identificadores estarán en los subtipos de entidad,
mientras que el tipo de entidad padre incorporará nuevos atributos.</li>
<li>Las instancias del tipo de entidad padre deben corresponderse con a lo sumo
una instancia de los subtipos de entidad.</li>
</ul>

<p>
Atención! En alguna bibliografía no se distingue a la unión de la generalización
/ especialización.
</p>

<p>
Ejemplo: Un banco trabaja con personas físicas y personas jurídicas radicadas en
argentina.
</p>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b91ee8" class="outline-2">
<h2 id="org3b91ee8">Ejemplos avanzados</h2>
<div class="outline-text-2" id="text-org3b91ee8">
</div>
<div id="outline-container-org25c325d" class="outline-3">
<h3 id="org25c325d">Ejemplo 3</h3>
<div class="outline-text-3" id="text-org25c325d">
<p>
La biblioteca necesita para funcionar una base de datos que mantenga un registro
sobre los socios, los ejemplares de libros existentes y los préstamos en curso,
de manera que se pueda consultar la disponibilidad de un cierto libro a partir
del nombre, los ejemplares prestados a un determinado socio, y si existen socios
con préstamos que daten más de una cierta fecha.
</p>

<ol class="org-ol">
<li>Paso 1: Identificar tipos de entidad</li>
<li>Paso 2: Identificar atributos</li>
<li>Paso 3: Identificar tipos de interrelación</li>
<li>Paso 4: Identificar atributos clave</li>
<li>Paso 5: Identificar restricciones estructurales</li>
</ol>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>
</div>
</div>

<div id="outline-container-org0009bbf" class="outline-3">
<h3 id="org0009bbf">Ejemplo 4</h3>
<div class="outline-text-3" id="text-org0009bbf">
<p>
Volvemos a considerar el caso del Registro Nacional de las Personas, pero
permitiendo también registrar a ciudadanos no argentinos cuando los mismos
contraen matrimonio con ciudadanos argentinos o se inscriben como padres de
ciudadanos nacidos argentinos.
</p>

<ol class="org-ol">
<li>Paso 1: Identificar tipos de entidad</li>
<li>Paso 2: Identificar atributos</li>
<li>Paso 3: Identificar tipos de interrelación</li>
<li>Paso 4: Identificar atributos clave</li>
<li>Paso 5: Identificar restricciones estructurales</li>
</ol>

<div class="org-src-container">
<pre class="src src-dot">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1ad363a" class="outline-2">
<h2 id="org1ad363a">Apéndice: Software de diseño conceptual</h2>
<div class="outline-text-2" id="text-org1ad363a">
<ul class="org-ul">
<li>Software CASE:
<ul class="org-ul">
<li>ERWin
<ul class="org-ul">
<li>No soporta notación de Chen; pago</li>
</ul></li>
<li>MS Visio
<ul class="org-ul">
<li>Pago</li>
</ul></li>
<li>Visual Paradigm
<ul class="org-ul">
<li>No soporta notación de Chen; tiene versión comunitaria gratis para uso no
comercial</li>
</ul></li>
<li>MySQL Workbench
<ul class="org-ul">
<li>No soporta notación de Chen</li>
</ul></li>
</ul></li>
<li>Software no-CASE:
<ul class="org-ul">
<li>Dia</li>
<li>LaTeX TikZ package</li>
<li>draw.io</li>
<li>Menos conocidos: SmartDraw (pago); Edraw (pago)</li>
</ul></li>
</ul>
</div>
</div>
