org/bdd/02_diseno_conceptual.org
* Bibliografía

  - [ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri, S.
    Navathe, 2016. Capítulo 3, Capítulo 4 Es la referencia principal y en la que
    se basa nuestra notación. Sólo hay una ligera diferencia en la notación para
    la participación y para la generalización/especialización respecto a la
    introducida aquí.

  - [GM09] Database Systems, The Complete Book, 2nd Edition. H. García-Molina, J.
    Ullman, J. Widom, 2009. Capítulo 4 Utiliza una notación distinta para la
    cardinalidad.

  - [RAMA02] Database Management Systems, 3rd Edition. R. Ramakrishnan, J.
    Gehrke, 2002. Capítulo 2 Utiliza una notación distinta para la cardinalidad.

  - The entity-relationship model - Toward a unified view of data P. Chen, 1976
    ACM Transactions on Database Systems, 1(1), 9–36. El paper original de P. Chen
    sobre el modelo ER. Disponible en:
    http://www.comp.nus.edu.sg/~lingtw/papers/tods76.chen.pdf.
