bdd/02_diseno_conceptual.html

<div id="outline-container-org6faf067" class="outline-2">
<h2 id="org6faf067">Bibliografía</h2>
<div class="outline-text-2" id="text-org6faf067">
<ul class="org-ul">
<li>[ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri, S.
Navathe, 2016. Capítulo 3, Capítulo 4 Es la referencia principal y en la que
se basa nuestra notación. Sólo hay una ligera diferencia en la notación para
la participación y para la generalización/especialización respecto a la
introducida aquí.</li>

<li>[GM09] Database Systems, The Complete Book, 2nd Edition. H. García-Molina, J.
Ullman, J. Widom, 2009. Capítulo 4 Utiliza una notación distinta para la
cardinalidad.</li>

<li>[RAMA02] Database Management Systems, 3rd Edition. R. Ramakrishnan, J.
Gehrke, 2002. Capítulo 2 Utiliza una notación distinta para la cardinalidad.</li>

<li>The entity-relationship model - Toward a unified view of data P. Chen, 1976
ACM Transactions on Database Systems, 1(1), 9–36. El paper original de P. Chen
sobre el modelo ER. Disponible en:
<a href="http://www.comp.nus.edu.sg/~lingtw/papers/tods76.chen.pdf">http://www.comp.nus.edu.sg/~lingtw/papers/tods76.chen.pdf</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:mk@sakura">mk@sakura</a>)</p>
<p class="date">Date: 2019-05-06 Mon 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="https://orgmode.org">Org</a> mode 9.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
